isabei/mems_emmc/STM32F4 Template - EMMC/SYSTEM/sdio/sdio.c
#include "stm32f4xx.h"
#include "sdio.h"
#include "delay.h"
#include "led.h"


static u32 CardType ;


typedef unsigned short OS_CPU_SR;
u8 TransferError ;
u8 TransferEnd ;
u8 StopCondition ;
u8 DMAEndOfTransfer;
EmmcCardInfo MyEmmcCardInfo;





void Emmc_Configuration(void)
{
  GPIO_InitTypeDef  GPIO_InitStructure;


  /* GPIOC and GPIOD Periph clock enable */
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOB|RCC_AHB1Periph_GPIOC | RCC_AHB1Periph_GPIOD, ENABLE);
	/* Enable the SDIO APB2 Clock */
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_SDIO, ENABLE);
//	RCC_APB2PeriphResetCmd(RCC_APB2Periph_SDIO, ENABLE);//SDIO????
	

  GPIO_PinAFConfig(GPIOC, GPIO_PinSource8,  GPIO_AF_SDIO);//SDIO0
  GPIO_PinAFConfig(GPIOC, GPIO_PinSource9,  GPIO_AF_SDIO);//SDIO1
  GPIO_PinAFConfig(GPIOC, GPIO_PinSource10, GPIO_AF_SDIO);//SDIO2
  GPIO_PinAFConfig(GPIOC, GPIO_PinSource11, GPIO_AF_SDIO);//SDIO3
	GPIO_PinAFConfig(GPIOB, GPIO_PinSource8,  GPIO_AF_SDIO);//SDIO4
	GPIO_PinAFConfig(GPIOB, GPIO_PinSource9,  GPIO_AF_SDIO);//SDIO5
	GPIO_PinAFConfig(GPIOC, GPIO_PinSource6,  GPIO_AF_SDIO);//SDIO6
	GPIO_PinAFConfig(GPIOC, GPIO_PinSource7,  GPIO_AF_SDIO);//SDIO7
	
  GPIO_PinAFConfig(GPIOC, GPIO_PinSource12, GPIO_AF_SDIO);//SDIO_CK
  GPIO_PinAFConfig(GPIOD, GPIO_PinSource2,  GPIO_AF_SDIO);//SDIO)CMD

	/* Configure DATA line */
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6 | GPIO_Pin_7 | GPIO_Pin_8 | GPIO_Pin_9 | GPIO_Pin_10 | GPIO_Pin_11;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
//  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
  GPIO_Init(GPIOC, &GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8 | GPIO_Pin_9;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
//  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
	GPIO_Init(GPIOB, &GPIO_InitStructure);

  /* Configure PD.02 CMD line */
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_OD;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_Init(GPIOD, &GPIO_InitStructure);

  /* Configure PC.12 pin: CLK pin */
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_12;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_Init(GPIOC, &GPIO_InitStructure);
//  RCC_APB2PeriphResetCmd(RCC_APB2Periph_SDIO, DISABLE);
}
void CmdOD2PP(void)
{
  GPIO_InitTypeDef  GPIO_InitStructure;
  /* GPIOC and GPIOD Periph clock enable */
  RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOD, ENABLE);
	/* Enable the SDIO APB2 Clock */
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_SDIO, ENABLE);
  GPIO_PinAFConfig(GPIOD, GPIO_PinSource2,  GPIO_AF_SDIO);//SDIO)CMD
  /* Configure PD.02 CMD line */
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_100MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_Init(GPIOD, &GPIO_InitStructure);
}

EmmcError EmmcInit(void)
{
 SDIO_InitTypeDef SDIO_InitStructure;

	__IO EmmcError Result = EMMC_OK;
  
  Emmc_Configuration();
  SDIO_DeInit();
  Result = EmmcPowerON();

  if (Result != EMMC_OK)
  {
//       LED3=0;
//			 LED4=1;
//			 LED5=1;
//		   delay_ms(100);
    return(Result);
  }
  Result = EmmcInitializeCards(&MyEmmcCardInfo);
	
  if (Result != EMMC_OK)
  {
//			 LED3=1;
//			 LED4=0;
//			 LED5=1;
//		   delay_ms(100);
    
		return(Result);
  }

  //CmdOD2PP();
	
	if (Result == EMMC_OK)
   {
     Result = EmmcEnableWideBusOperation(SDIO_BusWide_8b);
   }  
//   Result = EmmcReadExtCsd(&MyEmmcCardInfo);
//	if (EMMC_OK != Result)
//	{
//		return(Result);
//	}	

  return(Result);
}

/**
  * @brief  Enquires cards about their operating voltage and configures 
  *   clock controls.
  * @param  None
  * @retval EmmcError: SD Card Error code.
  */

EmmcError EmmcPowerON(void)
{
	SDIO_InitTypeDef SDIO_InitStructure;
	SDIO_CmdInitTypeDef SDIO_CmdInitStructure;
	
  __IO EmmcError Result = EMMC_OK; 
	u32 Cnt = 0;
	u32 i = 0;

  /*!< Power ON Sequence -----------------------------------------------------*/
  /*!< Configure the SDIO peripheral */
  /*!< SDIO_CK = SDIOCLK / (SDIO_INIT_CLK_DIV + 2) */
  /*!< on STM32F4xx devices, SDIOCLK is fixed to 48MHz */
  /*!< SDIO_CK for initialization should not exceed 400 KHz */  
  SDIO_InitStructure.SDIO_ClockDiv = SDIO_INIT_CLK_DIV;
  SDIO_InitStructure.SDIO_ClockEdge = SDIO_ClockEdge_Rising ;
  SDIO_InitStructure.SDIO_ClockBypass = SDIO_ClockBypass_Disable;
  SDIO_InitStructure.SDIO_ClockPowerSave = SDIO_ClockPowerSave_Disable;
  SDIO_InitStructure.SDIO_BusWide = SDIO_BusWide_8b;
  SDIO_InitStructure.SDIO_HardwareFlowControl = SDIO_HardwareFlowControl_Disable;
  SDIO_Init(&SDIO_InitStructure);

  /*!< Set Power State to ON */
  SDIO_SetPowerState(SDIO_PowerState_ON);
  /*!< Enable SDIO Clock */
  SDIO_ClockCmd(ENABLE);

	  /*!< CMD0: GO_IDLE_STATE ---------------------------------------------------*/
  /*!< No CMD response required */
  

	SDIO_CmdInitStructure.SDIO_Argument = 0x00;
  SDIO_CmdInitStructure.SDIO_CmdIndex = EMMC_CMD_GO_IDLE_STATE;
  SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_No;
  SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
  SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;		
  SDIO_SendCommand(&SDIO_CmdInitStructure);

  Result = CmdError();
  
  if (Result != EMMC_OK)
  {
    return(Result);
  }
	do
	{
      /*!< SEND CMD1*/
      SDIO_CmdInitStructure.SDIO_Argument = EMMC_OCR_REG;
      SDIO_CmdInitStructure.SDIO_CmdIndex = EMMC_CMD_SEND_OP_COND;
      SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;		  
      SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
      SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
      SDIO_SendCommand(&SDIO_CmdInitStructure);
			Result = CmdResp3Error();
			Cnt++;	
	}while((Cnt<100)&& (Result != EMMC_OK));
		
		/*!< SEND CMD1*/
		SDIO_CmdInitStructure.SDIO_Argument = EMMC_OCR_REG;
		SDIO_CmdInitStructure.SDIO_CmdIndex = EMMC_CMD_SEND_OP_COND;
		SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
		SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
		SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
		SDIO_SendCommand(&SDIO_CmdInitStructure);
		Result = CmdResp3Error();
	  return(Result);
}

/**
  * @brief  Intialises all cards or single card as the case may be Card(s) come 
  *         into standby state.
  * @param  None
  * @retval EmmcError: SD Card Error code.
  */
EmmcError EmmcInitializeCards(EmmcCardInfo *E)
{
	SDIO_CmdInitTypeDef SDIO_CmdInitStructure;
	SDIO_InitTypeDef SDIO_InitStructure;
  EmmcError Result = EMMC_OK;
	u32 CSD_Tab[4] = {0};
	u32 CID_Tab[4] = {0};
	
