isabei/mems_emmc/STM32F4 Template - EMMC/SYSTEM/sdio/sdio.c
	u16 Rca = 0x01;
  

  if (SDIO_GetPowerState() == SDIO_PowerState_OFF)
  {
    Result = EMMC_REQUEST_NOT_APPLICABLE;
    return(Result);
  }
    /*!< Send CMD2 ALL_SEND_CID */
    SDIO_CmdInitStructure.SDIO_Argument = 0x00000000;
    SDIO_CmdInitStructure.SDIO_CmdIndex = EMMC_CMD_ALL_SEND_CID;
    SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Long;
    SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
    SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
    SDIO_SendCommand(&SDIO_CmdInitStructure);
		
    Result = CmdResp2Error();

    if (EMMC_OK != Result)
    {
      return(Result);
    }
    CID_Tab[0] = SDIO_GetResponse(SDIO_RESP1);
    CID_Tab[1] = SDIO_GetResponse(SDIO_RESP2);
    CID_Tab[2] = SDIO_GetResponse(SDIO_RESP3);
    CID_Tab[3] = SDIO_GetResponse(SDIO_RESP4);
    
		/*!< Send CMD3 SET_REL_ADDR with argument 0 */
    /*!< SD Card publishes its RCA. */
    SDIO_CmdInitStructure.SDIO_Argument = 0x00010000;
    SDIO_CmdInitStructure.SDIO_CmdIndex = EMMC_CMD_SET_REL_ADDR;
    SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
    SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
    SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
    SDIO_SendCommand(&SDIO_CmdInitStructure);

    Result = CmdResp6Error(EMMC_CMD_SET_REL_ADDR, &Rca);

    if (EMMC_OK != Result)
    {
      return(Result);
    }
    /*!< Send CMD9 SEND_CSD with argument as card's RCA */
    SDIO_CmdInitStructure.SDIO_Argument = 0x00010000;
    SDIO_CmdInitStructure.SDIO_CmdIndex = EMMC_CMD_SEND_CSD;
    SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Long;
    SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
    SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
    SDIO_SendCommand(&SDIO_CmdInitStructure);

    Result = CmdResp2Error();

    if (EMMC_OK != Result)
    {
      return(Result);
    }
    CSD_Tab[0] = SDIO_GetResponse(SDIO_RESP1);
    CSD_Tab[1] = SDIO_GetResponse(SDIO_RESP2);
    CSD_Tab[2] = SDIO_GetResponse(SDIO_RESP3);
    CSD_Tab[3] = SDIO_GetResponse(SDIO_RESP4);	

	
	
	Result = EmmcSelectDeselect(0x00010000);
	if (EMMC_OK != Result)
	{
		return(Result);
	}
	
  Result = EmmcGetCardInfo(E, &CSD_Tab[0], &CID_Tab[0], Rca);
	if (EMMC_OK != Result)
	{
		return(Result);
	}
	
	Result = EMMC_OK; /*!< All cards get intialized */
  return(Result);
}

EmmcTransferState EmmcGetStatus(void)
{
		EmmcCardState CardState =  EMMC_CARD_TRANSFER;

		CardState = EmmcGetState();
		
		if (CardState == EMMC_CARD_TRANSFER)
		{
			return(EMMC_TRANSFER_OK);
		}
		else if (CardState == EMMC_CARD_RECEIVING)
		{
			return(EMMC_TRANSFER_OK);
		}
		
		else if(CardState == EMMC_CARD_ERROR)
		{
			return (EMMC_TRANSFER_ERROR);
		}
		else
		{
			return(EMMC_TRANSFER_BUSY);
		}
}

/**
  * @brief  Enables wide bus opeartion for the requeseted card if supported by 
  *         card.
  * @param  WideMode: Specifies the SD card wide bus mode. 
  *   This parameter can be one of the following values:
  *     @arg SDIO_BusWide_8b: 8-bit data transfer (Only for MMC)
  *     @arg SDIO_BusWide_4b: 4-bit data transfer
  *     @arg SDIO_BusWide_1b: 1-bit data transfer
  * @retval EmmcError: SD Card Error code.
  */
EmmcError EmmcEnableWideBusOperation(u32 WideMode)
{
	SDIO_InitTypeDef SDIO_InitStructure;
  EmmcError errorstatus = EMMC_OK;


    if (SDIO_BusWide_4b == WideMode)
    {
      errorstatus = EMMC_UNSUPPORTED_FEATURE;
			 return(errorstatus);

//      if (EMMC_OK == errorstatus)
//      {
//        /*!< Configure the SDIO peripheral */
//        SDIO_InitStructure.SDIO_ClockDiv = SDIO_TRANSFER_CLK_DIV; 
//        SDIO_InitStructure.SDIO_ClockEdge = SDIO_ClockEdge_Rising;
//        SDIO_InitStructure.SDIO_ClockBypass = SDIO_ClockBypass_Disable;
//        SDIO_InitStructure.SDIO_ClockPowerSave = SDIO_ClockPowerSave_Disable;
//        SDIO_InitStructure.SDIO_BusWide = SDIO_BusWide_8b;
//        SDIO_InitStructure.SDIO_HardwareFlowControl = SDIO_HardwareFlowControl_Disable;
//        SDIO_Init(&SDIO_InitStructure);
//      }
    }
    else if (SDIO_BusWide_8b == WideMode)
    {
      errorstatus = EmmcEnWideBus(ENABLE);

      if (EMMC_OK == errorstatus)
      {
        /*!< Configure the SDIO peripheral */
        SDIO_InitStructure.SDIO_ClockDiv = SDIO_TRANSFER_CLK_DIV; 
        SDIO_InitStructure.SDIO_ClockEdge = SDIO_ClockEdge_Rising;
        SDIO_InitStructure.SDIO_ClockBypass = SDIO_ClockBypass_Disable;
        SDIO_InitStructure.SDIO_ClockPowerSave = SDIO_ClockPowerSave_Disable;
        SDIO_InitStructure.SDIO_BusWide = SDIO_BusWide_8b;
        SDIO_InitStructure.SDIO_HardwareFlowControl = SDIO_HardwareFlowControl_Disable;
        SDIO_Init(&SDIO_InitStructure);
      }
    }
    else 
    {
      errorstatus = EmmcEnWideBus(DISABLE);

      if (EMMC_OK == errorstatus)
      {
        /*!< Configure the SDIO peripheral */
        SDIO_InitStructure.SDIO_ClockDiv = SDIO_TRANSFER_CLK_DIV; 
        SDIO_InitStructure.SDIO_ClockEdge = SDIO_ClockEdge_Rising;
        SDIO_InitStructure.SDIO_ClockBypass = SDIO_ClockBypass_Disable;
        SDIO_InitStructure.SDIO_ClockPowerSave = SDIO_ClockPowerSave_Disable;
        SDIO_InitStructure.SDIO_BusWide = SDIO_BusWide_1b;
        SDIO_InitStructure.SDIO_HardwareFlowControl = SDIO_HardwareFlowControl_Disable;
        SDIO_Init(&SDIO_InitStructure);
      }
    }
//  }

  return(errorstatus);
}

/**
  * @brief  Returns the current card's state.
  * @param  None
  * @retval EmmcCardState: EMMC Card Error or EMMC Card Current State.
  */
EmmcCardState EmmcGetState(void)
{
    u32 Resp = 0;
	
    if (EmmcSendStatus(&Resp) != EMMC_OK)
    {
      return EMMC_CARD_ERROR;
    }
    else
    {
      return (EmmcCardState)((Resp >> 9) & 0x0F);
    }
}

/**
  * @brief  Turns the SDIO output signals off.
  * @param  None
  * @retval EmmcError: SD Card Error code.
  */
EmmcError EmmcPowerOFF(void)
{
  EmmcError errorstatus = EMMC_OK;

  /*!< Set Power State to OFF */
  SDIO_SetPowerState(SDIO_PowerState_OFF);

  return(errorstatus);
}

EmmcError EmmcBusTest(void)
{
	SDIO_CmdInitTypeDef SDIO_CmdInitStructure;
	SDIO_DataInitTypeDef SDIO_DataInitStructure;
	EmmcError errorstatus = EMMC_OK;
	

	  SDIO_CmdInitStructure.SDIO_Argument = 0x0;
    SDIO_CmdInitStructure.SDIO_CmdIndex = EMMC_CMD_HS_BUSTEST_WRITE;
    SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
    SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
    SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
    SDIO_SendCommand(&SDIO_CmdInitStructure);
	  errorstatus = CmdResp1Error(EMMC_CMD_HS_BUSTEST_WRITE);
	  
