isabei/mems_emmc/STM32F4 Template - EMMC/SYSTEM/sdio/sdio.c
	if(errorstatus != EMMC_OK)
	{
		return(errorstatus);
	}

}
/**
  * @brief  Returns information about specific card.
  * @param  E: pointer to a SD_CardInfo structure that contains all SD card 
  *         information.
  * @retval EmmcError: SD Card Error code.
  *??CSD????????????,?????????????
  */
EmmcError EmmcGetCardInfo(EmmcCardInfo *E, u32 *CSD_Tab, u32 *CID_Tab, u16 Rca)
{
	
		EmmcError errorstatus = EMMC_OK;
		u8 tmp = 0;

		E->CardType = (u8)CardType;
		E->RCA = (u16)Rca;

		/*!< Byte 0 */
	  tmp = (u8)((CSD_Tab[0] & 0xFF000000) >> 24);      
		E->EmmcCsd.CSDStruct = (tmp & 0xC0) >> 6;
		E->EmmcCsd.SysSpecVersion = (tmp & 0x3C) >> 2;
		E->EmmcCsd.Reserved1 = tmp & 0x03;

		/*!< Byte 1 */
		tmp = (u8)((CSD_Tab[0] & 0x00FF0000) >> 16);
		E->EmmcCsd.TAAC = tmp;

		/*!< Byte 2 */
		tmp = (u8)((CSD_Tab[0] & 0x0000FF00) >> 8);
		E->EmmcCsd.NSAC = tmp;

		/*!< Byte 3 */
		tmp = (u8)(CSD_Tab[0] & 0x000000FF);
		E->EmmcCsd.MaxBusClkFrec = tmp;

		/*!< Byte 4 */
		tmp = (u8)((CSD_Tab[1] & 0xFF000000) >> 24);
		E->EmmcCsd.CardComdClasses = tmp << 4;

		/*!< Byte 5 */
		tmp = (u8)((CSD_Tab[1] & 0x00FF0000) >> 16);
		E->EmmcCsd.CardComdClasses |= (tmp & 0xF0) >> 4;
		E->EmmcCsd.RdBlockLen = tmp & 0x0F;

		/*!< Byte 6 */
		tmp = (u8)((CSD_Tab[1] & 0x0000FF00) >> 8);
		E->EmmcCsd.PartBlockRead = (tmp & 0x80) >> 7;
		E->EmmcCsd.WrBlockMisalign = (tmp & 0x40) >> 6;
		E->EmmcCsd.RdBlockMisalign = (tmp & 0x20) >> 5;
		E->EmmcCsd.DSRImpl = (tmp & 0x10) >> 4;
		E->EmmcCsd.Reserved2 = 0; /*!< Reserved */


		E->EmmcCsd.DeviceSize = (tmp & 0x03) << 10;

		/*!< Byte 7 */
		tmp = (u8)(CSD_Tab[1] & 0x000000FF);
		E->EmmcCsd.DeviceSize |= (tmp) << 2;

		/*!< Byte 8 */
		tmp = (u8)((CSD_Tab[2] & 0xFF000000) >> 24);
		E->EmmcCsd.DeviceSize |= (tmp & 0xC0) >> 6;

		E->EmmcCsd.MaxRdCurrentVDDMin = (tmp & 0x38) >> 3;
		E->EmmcCsd.MaxRdCurrentVDDMax = (tmp & 0x07);

		/*!< Byte 9 */
		tmp = (u8)((CSD_Tab[2] & 0x00FF0000) >> 16);
		E->EmmcCsd.MaxWrCurrentVDDMin = (tmp & 0xE0) >> 5;
		E->EmmcCsd.MaxWrCurrentVDDMax = (tmp & 0x1C) >> 2;
		E->EmmcCsd.DeviceSizeMul = (tmp & 0x03) << 1;
		/*!< Byte 10 */
		tmp = (u8)((CSD_Tab[2] & 0x0000FF00) >> 8);
		E->EmmcCsd.DeviceSizeMul |= (tmp & 0x80) >> 7;


		E->CardBlockSize = 1 << (E->EmmcCsd.RdBlockLen);//??????


		E->CardCapacity = (u32)((u32)(E->EmmcExtCsd.EXT_CSD.SEC_COUNT[3] << 24 | E->EmmcExtCsd.EXT_CSD.SEC_COUNT[2] << 16 | 
		E->EmmcExtCsd.EXT_CSD.SEC_COUNT[1] << 8 | E->EmmcExtCsd.EXT_CSD.SEC_COUNT[0]) * E->CardBlockSize);


		E->EmmcCsd.EraseGrSize = (tmp & 0x40) >> 6;
		E->EmmcCsd.EraseGrMul = (tmp & 0x3F) << 1;

		/*!< Byte 11 */
		tmp = (u8)(CSD_Tab[2] & 0x000000FF);
		E->EmmcCsd.EraseGrMul |= (tmp & 0x80) >> 7;
		E->EmmcCsd.WrProtectGrSize = (tmp & 0x7F);

		/*!< Byte 12 */
		tmp = (u8)((CSD_Tab[3] & 0xFF000000) >> 24);
		E->EmmcCsd.WrProtectGrEnable = (tmp & 0x80) >> 7;
		E->EmmcCsd.ManDeflECC = (tmp & 0x60) >> 5;
		E->EmmcCsd.WrSpeedFact = (tmp & 0x1C) >> 2;
		E->EmmcCsd.MaxWrBlockLen = (tmp & 0x03) << 2;

		/*!< Byte 13 */
		tmp = (u8)((CSD_Tab[3] & 0x00FF0000) >> 16);
		E->EmmcCsd.MaxWrBlockLen |= (tmp & 0xC0) >> 6;
		E->EmmcCsd.WriteBlockPaPartial = (tmp & 0x20) >> 5;
		E->EmmcCsd.Reserved3 = 0;
		E->EmmcCsd.ContentProtectAppli = (tmp & 0x01);

		/*!< Byte 14 */
		tmp = (u8)((CSD_Tab[3] & 0x0000FF00) >> 8);
		E->EmmcCsd.FileFormatGrouop = (tmp & 0x80) >> 7;
		E->EmmcCsd.CopyFlag = (tmp & 0x40) >> 6;
		E->EmmcCsd.PermWrProtect = (tmp & 0x20) >> 5;
		E->EmmcCsd.TempWrProtect = (tmp & 0x10) >> 4;
		E->EmmcCsd.FileFormat = (tmp & 0x0C) >> 2;
		E->EmmcCsd.ECC = (tmp & 0x03);

		/*!< Byte 15 */
		tmp = (u8)(CSD_Tab[3] & 0x000000FF);
		E->EmmcCsd.CSD_CRC = (tmp & 0xFE) >> 1;
		E->EmmcCsd.Reserved4 = 1;
		
		
		

    /**************************CSD REG*****************************/
		/*!< Byte 0 */
		tmp = (u8)((CID_Tab[0] & 0xFF000000) >> 24);
		E->EmmcCid.ManufacturerID = tmp;

		/*!< Byte 1 */
		tmp = (u8)((CID_Tab[0] & 0x00FF0000) >> 16);
		E->EmmcCid.Reserved1 = (tmp & 0xFC)>>2;
		E->EmmcCid.CardorBGA = (tmp & 0x03);
		
		

		/*!< Byte 2 */
		tmp = (u8)((CID_Tab[0] & 0x000000FF00) >> 8);
		E->EmmcCid.OEM_AppliID = tmp;

		/*!< Byte 3 */
		tmp = (u8)(CID_Tab[0] & 0x000000FF);
		E->EmmcCid.ProdName1 = tmp << 24;

		/*!< Byte 4 */
		tmp = (u8)((CID_Tab[1] & 0xFF000000) >> 24);
		E->EmmcCid.ProdName1 |= tmp << 16;

		/*!< Byte 5 */
		tmp = (u8)((CID_Tab[1] & 0x00FF0000) >> 16);
		E->EmmcCid.ProdName1 |= tmp << 8;

		/*!< Byte 6 */
		tmp = (u8)((CID_Tab[1] & 0x0000FF00) >> 8);
		E->EmmcCid.ProdName1 |= tmp;

		/*!< Byte 7 */
		tmp = (u8)(CID_Tab[1] & 0x000000FF);
		E->EmmcCid.ProdName2 = tmp << 8;

		/*!< Byte 8 */
		tmp = (u8)((CID_Tab[2] & 0xFF000000) >> 24);
		E->EmmcCid.ProdName2 = tmp;

		/*!< Byte 9 */
		tmp = (u8)((CID_Tab[2] & 0x00FF0000) >> 16);
		E->EmmcCid.ProdRev = tmp;

		/*!< Byte 10 */
		tmp = (u8)((CID_Tab[2] & 0x0000FF00) >> 8);
		E->EmmcCid.ProdSN = tmp << 24;

		/*!< Byte 11 */
		tmp = (u8)(CID_Tab[2] & 0x000000FF);
		E->EmmcCid.ProdSN |= tmp << 16;

		/*!< Byte 12 */
		tmp = (u8)((CID_Tab[3] & 0xFF000000) >> 24);
		E->EmmcCid.ProdSN |= tmp << 8;

		/*!< Byte 13 */
		tmp = (u8)((CID_Tab[3] & 0x00FF0000) >> 16);
    E->EmmcCid.ProdSN |= tmp;

		/*!< Byte 14 */
		tmp = (u8)((CID_Tab[3] & 0x0000FF00) >> 8);
		E->EmmcCid.ManufactDate = tmp;

		/*!< Byte 15 */
		tmp = (u8)(CID_Tab[3] & 0x000000FF);
		E->EmmcCid.CID_CRC = (tmp & 0xFE) >> 1;
		E->EmmcCid.Reserved2 = 1;
  
  return(errorstatus);
}




/**
  * @brief  Selects od Deselects the corresponding card.
  * @param  addr: Address of the Card to be selected.
  * @retval EmmcError: SD Card Error code.
  */
EmmcError EmmcSelectDeselect(u32 addr)
{
	SDIO_CmdInitTypeDef SDIO_CmdInitStructure;
  EmmcError errorstatus = EMMC_OK;

  /*!< Send CMD7 SDIO_SEL_DESEL_CARD */
  SDIO_CmdInitStructure.SDIO_Argument =  addr;
  SDIO_CmdInitStructure.SDIO_CmdIndex = EMMC_CMD_SEL_DESEL_CARD;
  SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
  SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
  SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
  SDIO_SendCommand(&SDIO_CmdInitStructure);

  errorstatus = CmdResp1Error(EMMC_CMD_SEL_DESEL_CARD);

  return(errorstatus);
}


EmmcError EmmcReadExtCsd(EmmcCardInfo *E)
{
	SDIO_CmdInitTypeDef SDIO_CmdInitStructure;
	SDIO_DataInitTypeDef SDIO_DataInitStructure;
	
