isabei/mems_emmc/STM32F4 Template - EMMC/SYSTEM/sdio/sdio.c
	EmmcError Result = EMMC_OK;
	u32 count = 0;
  u32 *ExtCsdBuf;
	ExtCsdBuf = (u32 *)(&(E->EmmcExtCsd.CsdBuf[0]));

	SDIO_DataInitStructure.SDIO_DataTimeOut = EMMC_DATATIMEOUT;
  SDIO_DataInitStructure.SDIO_DataLength = (u32)512;
  SDIO_DataInitStructure.SDIO_DataBlockSize = SDIO_DataBlockSize_512b;
  SDIO_DataInitStructure.SDIO_TransferDir = SDIO_TransferDir_ToSDIO;
  SDIO_DataInitStructure.SDIO_TransferMode = SDIO_TransferMode_Block;
  SDIO_DataInitStructure.SDIO_DPSM = SDIO_DPSM_Enable;
  SDIO_DataConfig(&SDIO_DataInitStructure);
	

	/* CMD8 */ 
  SDIO_CmdInitStructure.SDIO_Argument = 0x0;
  SDIO_CmdInitStructure.SDIO_CmdIndex = EMMC_CMD_HS_SEND_EXT_CSD;
  SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
  SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
  SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
  SDIO_SendCommand(&SDIO_CmdInitStructure);

  Result = CmdResp1Error(EMMC_CMD_HS_SEND_EXT_CSD);
	
  if (EMMC_OK != Result)
  {
    return(Result);
  }


while (!(SDIO->STA &(SDIO_FLAG_RXOVERR | SDIO_FLAG_DCRCFAIL | SDIO_FLAG_DTIMEOUT | SDIO_FLAG_DBCKEND | SDIO_FLAG_STBITERR)))
{
	if (SDIO_GetFlagStatus(SDIO_FLAG_RXFIFOHF) != RESET)
	{
		for (count = 0; count < 8; count++)
		{
			*(ExtCsdBuf + count) = SDIO_ReadData();
		}
		ExtCsdBuf += 8;
	}
}
  if (SDIO_GetFlagStatus(SDIO_FLAG_DTIMEOUT) != RESET)
  {
    SDIO_ClearFlag(SDIO_FLAG_DTIMEOUT);
    Result = EMMC_DATA_TIMEOUT;
    return(Result);
  }
  else if (SDIO_GetFlagStatus(SDIO_FLAG_DCRCFAIL) != RESET)
  {
    SDIO_ClearFlag(SDIO_FLAG_DCRCFAIL);
    Result = EMMC_DATA_CRC_FAIL;
    return(Result);
  }
  else if (SDIO_GetFlagStatus(SDIO_FLAG_RXOVERR) != RESET)
  {
    SDIO_ClearFlag(SDIO_FLAG_RXOVERR);
    Result =EMMC_RX_OVERRUN;
    return(Result);
  }
  else if (SDIO_GetFlagStatus(SDIO_FLAG_STBITERR) != RESET)
  {
    SDIO_ClearFlag(SDIO_FLAG_STBITERR);
    Result = EMMC_START_BIT_ERR;
    return(Result);
  }
  count = EMMC_DATATIMEOUT;
	
  while ((SDIO_GetFlagStatus(SDIO_FLAG_RXDAVL) != RESET) && (count > 0))
  {
    *ExtCsdBuf = SDIO_ReadData();
    ExtCsdBuf++;
    count--;
  }
  
  /*!< Clear all the static flags */
  SDIO_ClearFlag(SDIO_STATIC_FLAGS);
	
  return Result;
}

/**
  * @brief  Allows to read one block from a specified address in a card. The Data
  *         transfer can be managed by DMA mode or Polling mode. 
  * @note   This operation should be followed by two functions to check if the 
  *         DMA Controller and SD Card status.
  *          - SD_ReadWaitOperation(): this function insure that the DMA
  *            controller has finished all data transfer.
  *          - SD_GetStatus(): to check that the SD Card has finished the 
  *            data transfer and it is ready for data.            
  * @param  readbuff: pointer to the buffer that will contain the received data
  * @param  ReadAddr: Address from where data are to be read.  
  * @param  BlockSize: the SD card Data block size. The Block size should be 512.
  * @retval EmmcError: SD Card Error code.
  */



 /***************************??????*****************************/
EmmcError EmmcReadBlock(u8 *readbuff, u32 ReadAddr, u16 BlockSize)
{
	SDIO_CmdInitTypeDef SDIO_CmdInitStructure;
	SDIO_DataInitTypeDef SDIO_DataInitStructure;
  EmmcError errorstatus = EMMC_OK;
#if defined (SD_POLLING_MODE) 
  u32 count = 0, *tempbuff = (u32 *)readbuff;
#endif

   TransferError = EMMC_OK;
   TransferEnd = 0;
   StopCondition = 0;
  
  SDIO->DCTRL = 0x0;

  /* Set Block Size for Card */ 
  SDIO_CmdInitStructure.SDIO_Argument = (u32) BlockSize;
  SDIO_CmdInitStructure.SDIO_CmdIndex = EMMC_CMD_SET_BLOCKLEN;
  SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
  SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
  SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
  SDIO_SendCommand(&SDIO_CmdInitStructure);

  errorstatus = CmdResp1Error(EMMC_CMD_SET_BLOCKLEN);

  if (EMMC_OK != errorstatus)
  {
    return(errorstatus);
  }
  
  SDIO_DataInitStructure.SDIO_DataTimeOut = EMMC_DATATIMEOUT;
  SDIO_DataInitStructure.SDIO_DataLength = BlockSize;
  SDIO_DataInitStructure.SDIO_DataBlockSize = (u32) 9 << 4;
  SDIO_DataInitStructure.SDIO_TransferDir = SDIO_TransferDir_ToSDIO;
  SDIO_DataInitStructure.SDIO_TransferMode = SDIO_TransferMode_Block;
  SDIO_DataInitStructure.SDIO_DPSM = SDIO_DPSM_Disable;
  SDIO_DataConfig(&SDIO_DataInitStructure);
	
	SDIO_DataInitStructure.SDIO_DataTimeOut = EMMC_DATATIMEOUT;
  SDIO_DataInitStructure.SDIO_DataLength = BlockSize;
  SDIO_DataInitStructure.SDIO_DataBlockSize = (u32) 9 << 4;
  SDIO_DataInitStructure.SDIO_TransferDir = SDIO_TransferDir_ToSDIO;
  SDIO_DataInitStructure.SDIO_TransferMode = SDIO_TransferMode_Block;
  SDIO_DataInitStructure.SDIO_DPSM = SDIO_DPSM_Enable;
  SDIO_DataConfig(&SDIO_DataInitStructure);
	
	

  /*!< Send CMD17 READ_SINGLE_BLOCK */
  SDIO_CmdInitStructure.SDIO_Argument = (u32)ReadAddr;
  SDIO_CmdInitStructure.SDIO_CmdIndex = EMMC_CMD_READ_SINGLE_BLOCK;
  SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
  SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
  SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
  SDIO_SendCommand(&SDIO_CmdInitStructure);

  errorstatus = CmdResp1Error(EMMC_CMD_READ_SINGLE_BLOCK);

  if (errorstatus != EMMC_OK)
  {
    return(errorstatus);
  }

#if defined (SD_POLLING_MODE)  
  /*!< In case of single block transfer, no need of stop transfer at all.*/
  /*!< Polling mode */
  while (!(SDIO->STA &(SDIO_FLAG_RXOVERR | SDIO_FLAG_DCRCFAIL | SDIO_FLAG_DTIMEOUT | SDIO_FLAG_DBCKEND | SDIO_FLAG_STBITERR)))
  {
    if (SDIO_GetFlagStatus(SDIO_FLAG_RXFIFOHF) != RESET)
    {
      for (count = 0; count < 8; count++)
      {
        *(tempbuff + count) = SDIO_ReadData();
      }
      tempbuff += 8;
    }
  }

  if (SDIO_GetFlagStatus(SDIO_FLAG_DTIMEOUT) != RESET)
  {
    SDIO_ClearFlag(SDIO_FLAG_DTIMEOUT);
    errorstatus = EMMC_DATA_TIMEOUT;
    return(errorstatus);
  }
  else if (SDIO_GetFlagStatus(SDIO_FLAG_DCRCFAIL) != RESET)
  {
    SDIO_ClearFlag(SDIO_FLAG_DCRCFAIL);
    errorstatus = EMMC_DATA_CRC_FAIL;
    return(errorstatus);
  }
  else if (SDIO_GetFlagStatus(SDIO_FLAG_RXOVERR) != RESET)
  {
    SDIO_ClearFlag(SDIO_FLAG_RXOVERR);
    errorstatus =EMMC_RX_OVERRUN;
    return(errorstatus);
  }
  else if (SDIO_GetFlagStatus(SDIO_FLAG_STBITERR) != RESET)
  {
    SDIO_ClearFlag(SDIO_FLAG_STBITERR);
    errorstatus = EMMC_START_BIT_ERR;
    return(errorstatus);
  }
  count = EMMC_DATATIMEOUT;
  while ((SDIO_GetFlagStatus(SDIO_FLAG_RXDAVL) != RESET) && (count > 0))
  {
    *tempbuff = SDIO_ReadData();
    tempbuff++;
    count--;
  }
  
  /*!< Clear all the static flags */
  SDIO_ClearFlag(SDIO_STATIC_FLAGS);
#endif

//#if defined (SD_DMA_MODE)
//    SDIO_ITConfig(SDIO_IT_DCRCFAIL | SDIO_IT_DTIMEOUT | SDIO_IT_DATAEND | SDIO_IT_RXOVERR | SDIO_IT_STBITERR, ENABLE);
//    SDIO_DMACmd(ENABLE);
//    EmmcLowLevelDMARxConfig((u32 *)readbuff, BlockSize);
//	
//		errorstatus = EmmcWaitReadOperation();
//		if(errorstatus !=  EMMC_OK)
//		{
//			return errorstatus;
//		}
//	
//#endif
  return(errorstatus);
}

/**
  * @brief  Allows to read blocks from a specified address  in a card.  The Data
  *         transfer can be managed by DMA mode or Polling mode. 
  * @note   This operation should be followed by two functions to check if the 
  *         DMA Controller and SD Card status.
  *          - SD_ReadWaitOperation(): this function insure that the DMA
  *            controller has finished all data transfer.
  *          - EmmcGetStatus(): to check that the SD Card has finished the 
  *            data transfmer and it is ready for data.   
  * @param  readbuff: pointer to the buffer that will contain the received data.
  * @param  ReadAddr: Address from where data are to be read.
  * @param  BlockSize: the SD card Data block size. The Block size should be 512.
  * @param  NumberOfBlocks: number of blocks to be read.
  * @retval EmmcError: SD Card Error code.
  */
EmmcError EmmcReadMultiBlocks(u8 *readbuff, u32 ReadAddr, u16 BlockSize, u32 NumberOfBlocks)
{
	SDIO_CmdInitTypeDef SDIO_CmdInitStructure;
	SDIO_DataInitTypeDef SDIO_DataInitStructure;
	
  EmmcError errorstatus = EMMC_OK;
  //OS_CPU_SR cpu_sr=0;
#if defined (SD_POLLING_MODE) 
  u32 count = 0, *tempbuff = (u32 *)readbuff;
#endif

  //u8 TransferError = EMMC_OK;
  //u8 TransferEnd = 0;
//  u8 StopCondition = 1;
			
	//OS_ENTER_CRITICAL();

