isabei/mems_emmc/STM32F4 Template - EMMC/SYSTEM/sdio/sdio.c
  SDIO->DCTRL = 0x0;

  /*!< Set Block Size for Card */
  SDIO_CmdInitStructure.SDIO_Argument = (u32) BlockSize;
  SDIO_CmdInitStructure.SDIO_CmdIndex = EMMC_CMD_SET_BLOCKLEN;
  SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
  SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
  SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
  SDIO_SendCommand(&SDIO_CmdInitStructure);

  errorstatus = CmdResp1Error(EMMC_CMD_SET_BLOCKLEN);

  if (EMMC_OK != errorstatus)
  {
    return(errorstatus);
  }
    
  SDIO_DataInitStructure.SDIO_DataTimeOut = EMMC_DATATIMEOUT;
  SDIO_DataInitStructure.SDIO_DataLength = NumberOfBlocks * BlockSize;
  SDIO_DataInitStructure.SDIO_DataBlockSize = (u32) 9 << 4;
  SDIO_DataInitStructure.SDIO_TransferDir = SDIO_TransferDir_ToSDIO;
  SDIO_DataInitStructure.SDIO_TransferMode = SDIO_TransferMode_Block;
  SDIO_DataInitStructure.SDIO_DPSM = SDIO_DPSM_Disable;
  SDIO_DataConfig(&SDIO_DataInitStructure);
	
  SDIO_DataInitStructure.SDIO_DataTimeOut = EMMC_DATATIMEOUT;
  SDIO_DataInitStructure.SDIO_DataLength = NumberOfBlocks * BlockSize;
  SDIO_DataInitStructure.SDIO_DataBlockSize = (u32) 9 << 4;
  SDIO_DataInitStructure.SDIO_TransferDir = SDIO_TransferDir_ToSDIO;
  SDIO_DataInitStructure.SDIO_TransferMode = SDIO_TransferMode_Block;
  SDIO_DataInitStructure.SDIO_DPSM = SDIO_DPSM_Enable;
  SDIO_DataConfig(&SDIO_DataInitStructure);

  /*!< Send CMD18 READ_MULT_BLOCK with argument data address */
  SDIO_CmdInitStructure.SDIO_Argument = (u32)ReadAddr;
  SDIO_CmdInitStructure.SDIO_CmdIndex = EMMC_CMD_READ_MULT_BLOCK;
  SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
  SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
  SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
  SDIO_SendCommand(&SDIO_CmdInitStructure);

  errorstatus = CmdResp1Error(EMMC_CMD_READ_MULT_BLOCK);
//  OS_EXIT_CRITICAL();
  if (errorstatus != EMMC_OK)
  {
    return(errorstatus);
  }

#if defined (SD_POLLING_MODE)  

   while (!(SDIO->STA &(SDIO_FLAG_RXOVERR | SDIO_FLAG_DCRCFAIL | SDIO_FLAG_DATAEND | SDIO_FLAG_DTIMEOUT | SDIO_FLAG_STBITERR)))
   {
     if (SDIO_GetFlagStatus(SDIO_FLAG_RXFIFOHF) != RESET)
     {
	   for (count = 0; count < EMMC_HALFFIFO; count++)
       {
         *(tempbuff + count) = SDIO_ReadData();
       }
       tempbuff += EMMC_HALFFIFO;
     }
   }

   if (SDIO_GetFlagStatus(SDIO_FLAG_DTIMEOUT) != RESET)
   {
     SDIO_ClearFlag(SDIO_FLAG_DTIMEOUT);
     errorstatus = EMMC_DATA_TIMEOUT;
     return(errorstatus);
   }
   else if (SDIO_GetFlagStatus(SDIO_FLAG_DCRCFAIL) != RESET)
   {
     SDIO_ClearFlag(SDIO_FLAG_DCRCFAIL);
     errorstatus = EMMC_DATA_CRC_FAIL;
     return(errorstatus);
   }
   else if (SDIO_GetFlagStatus(SDIO_FLAG_RXOVERR) != RESET)
   {
     SDIO_ClearFlag(SDIO_FLAG_RXOVERR);
     errorstatus = EMMC_RX_OVERRUN;
     return(errorstatus);
   }
   else if (SDIO_GetFlagStatus(SDIO_FLAG_STBITERR) != RESET)
   {
     SDIO_ClearFlag(SDIO_FLAG_STBITERR);
     errorstatus = EMMC_START_BIT_ERR;
     return(errorstatus);
   }
   while (SDIO_GetFlagStatus(SDIO_FLAG_RXDAVL) != RESET)
   {
     *tempbuff = SDIO_ReadData();
     tempbuff++;
   }

   if (SDIO_GetFlagStatus(SDIO_FLAG_DATAEND) != RESET)
   {
     /* In Case Of SD-CARD Send Command STOP_TRANSMISSION */
//     if ((SDIO_STD_CAPACITY_SD_CARD_V1_1 == CardType) || (SDIO_HIGH_CAPACITY_SD_CARD == CardType) || (SDIO_STD_CAPACITY_SD_CARD_V2_0 == CardType))
//     {
       /* Send CMD12 STOP_TRANSMISSION */
       SDIO_CmdInitStructure.SDIO_Argument = 0x0;
       SDIO_CmdInitStructure.SDIO_CmdIndex = EMMC_CMD_STOP_TRANSMISSION;
       SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
       SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
       SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
       SDIO_SendCommand(&SDIO_CmdInitStructure);

       errorstatus = CmdResp1Error(EMMC_CMD_STOP_TRANSMISSION);

       if (errorstatus != EMMC_OK)
       {
         return(errorstatus);
       }
//     }
   }   
  /*!< Clear all the static flags */
  SDIO_ClearFlag(SDIO_STATIC_FLAGS);
#endif

//#if defined (SD_DMA_MODE)
//	 OS_ENTER_CRITICAL();
//  SDIO_ITConfig(SDIO_IT_DCRCFAIL | SDIO_IT_DTIMEOUT | SDIO_IT_DATAEND | SDIO_IT_RXOVERR | SDIO_IT_STBITERR, ENABLE);
//  SDIO_DMACmd(ENABLE);
//  EmmcLowLevelDMARxConfig((u32 *)readbuff, (NumberOfBlocks * BlockSize));
//	  OS_EXIT_CRITICAL();
//	errorstatus = EmmcWaitReadOperation();
//	if(errorstatus !=  EMMC_OK)
//	{
//		return errorstatus;
//	}
//#endif			
  return(errorstatus);
}

/**
  * @brief  This function waits until the SDIO DMA data transfer is finished. 
  *         This function should be called after SDIO_ReadMultiBlocks() function
  *         to insure that all data sent by the card are already transferred by 
  *         the DMA controller.
  * @param  None.
  * @retval EmmcError: SD Card Error code.
  */
//EmmcError EmmcWaitReadOperation(void)
//{
//  EmmcError errorstatus = EMMC_OK;
//	OS_CPU_SR cpu_sr=0;
//  u32 timeout;
//	

//  timeout = EMMC_DATATIMEOUT;
//  
//  while ((DMAEndOfTransfer == 0x00) && (TransferEnd == 0) && (TransferError == EMMC_OK) && (timeout > 0))
//  {
//    timeout--;
//  }
//  
//  DMAEndOfTransfer = 0x00;

//  timeout = EMMC_DATATIMEOUT;
//  
//  while(((SDIO->STA & SDIO_FLAG_RXACT)) && (timeout > 0))
//  {
//    timeout--;  
//  }

//  if (StopCondition == 1)
//  {
//		//OS_ENTER_CRITICAL();
//    errorstatus = EmmcStopTransfer();
//		//OS_EXIT_CRITICAL();
//		StopCondition = 0;
//  }
//  
//  if ((timeout == 0) && (errorstatus == EMMC_OK))
//  {
//    errorstatus = EMMC_DATA_TIMEOUT;
//  }
//  
//  /*!< Clear all the static flags */
//  SDIO_ClearFlag(SDIO_STATIC_FLAGS);

////  if (TransferError != EMMC_OK)
////  {
////    return(TransferError);
////  }
//  else
//  {
//    return(errorstatus);  
//  }
//}

/**
  * @brief  Allows to write one block starting from a specified address in a card.
  *         The Data transfer can be managed by DMA mode or Polling mode.
  * @note   This operation should be followed by two functions to check if the 
  *         DMA Controller and SD Card status.
  *          - SD_ReadWaitOperation(): this function insure that the DMA
  *            controller has finished all data transfer.
  *          - SD_GetStatus(): to check that the SD Card has finished the 
  *            data transfer and it is ready for data.      
  * @param  writebuff: pointer to the buffer that contain the data to be transferred.
  * @param  WriteAddr: Address from where data are to be read.   
  * @param  BlockSize: the SD card Data block size. The Block size should be 512.
  * @retval EmmcError: SD Card Error code.
  */
EmmcError EmmcWriteBlock(u8 *writebuff, u32 WriteAddr, u16 BlockSize)
{
	SDIO_CmdInitTypeDef SDIO_CmdInitStructure;
	SDIO_DataInitTypeDef SDIO_DataInitStructure;

  EmmcError errorstatus = EMMC_OK;
	EmmcTransferState TranResult;
	u8 cardstate = 0;

#if defined (SD_POLLING_MODE)
  u32 bytestransferred = 0, count = 0, restwords = 0;
  u32 *tempbuff = (u32 *)writebuff;
#endif

