isabei/mems_emmc/STM32F4 Template - EMMC/SYSTEM/sdio/sdio.c
  TransferError = EMMC_OK;
  TransferEnd = 0;
  StopCondition = 0;
  
				
  SDIO->DCTRL = 0x0;

  SDIO_DataInitStructure.SDIO_DataTimeOut = EMMC_DATATIMEOUT;
  SDIO_DataInitStructure.SDIO_DataLength = BlockSize;
  SDIO_DataInitStructure.SDIO_DataBlockSize = (u32) 9 << 4;
  SDIO_DataInitStructure.SDIO_TransferDir = SDIO_TransferDir_ToCard;
  SDIO_DataInitStructure.SDIO_TransferMode = SDIO_TransferMode_Block;
  SDIO_DataInitStructure.SDIO_DPSM = SDIO_DPSM_Disable;
  SDIO_DataConfig(&SDIO_DataInitStructure);
	
	/* Set Block Size for Card */ 
  SDIO_CmdInitStructure.SDIO_Argument = (u32) BlockSize;
  SDIO_CmdInitStructure.SDIO_CmdIndex = EMMC_CMD_SET_BLOCKLEN;
  SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
  SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
  SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
  SDIO_SendCommand(&SDIO_CmdInitStructure);

  errorstatus = CmdResp1Error(EMMC_CMD_SET_BLOCKLEN);

  if (EMMC_OK != errorstatus)
  {
    return(errorstatus);
  }
    
  /*!< Send CMD24 WRITE_SINGLE_BLOCK */
  SDIO_CmdInitStructure.SDIO_Argument = WriteAddr;
  SDIO_CmdInitStructure.SDIO_CmdIndex = EMMC_CMD_WRITE_SINGLE_BLOCK;
  SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
  SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
  SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
  SDIO_SendCommand(&SDIO_CmdInitStructure);

  errorstatus = CmdResp1Error(EMMC_CMD_WRITE_SINGLE_BLOCK);

  if (errorstatus != EMMC_OK)
  {
    return(errorstatus);
  }

	do
	{		
	    TranResult = EmmcGetStatus();
	}while(TranResult != EMMC_TRANSFER_OK);
	
  /*!< In case of single data block transfer no need of stop command at all */
#if defined (SD_POLLING_MODE) 
  while (!(SDIO->STA & (SDIO_FLAG_DBCKEND | SDIO_FLAG_TXUNDERR | SDIO_FLAG_DCRCFAIL | SDIO_FLAG_DTIMEOUT | SDIO_FLAG_STBITERR)))
  {
    if (SDIO_GetFlagStatus(SDIO_FLAG_TXFIFOHE) != RESET)
    {
      if ((512 - bytestransferred) < 32)
      {
        restwords = ((512 - bytestransferred) % 4 == 0) ? ((512 - bytestransferred) / 4) : (( 512 -  bytestransferred) / 4 + 1);
        for (count = 0; count < restwords; count++, tempbuff++, bytestransferred += 4)
        {
          SDIO_WriteData(*tempbuff);
        }
      }
      else
      {
        for (count = 0; count < 8; count++)
        {
          SDIO_WriteData(*(tempbuff + count));
        }
        tempbuff += 8;
        bytestransferred += 32;
      }
    }
  }
  if (SDIO_GetFlagStatus(SDIO_FLAG_DTIMEOUT) != RESET)
  {
    SDIO_ClearFlag(SDIO_FLAG_DTIMEOUT);
    errorstatus = EMMC_DATA_TIMEOUT;
    return(errorstatus);
  }
  else if (SDIO_GetFlagStatus(SDIO_FLAG_DCRCFAIL) != RESET)
  {
    SDIO_ClearFlag(SDIO_FLAG_DCRCFAIL);
    errorstatus = EMMC_DATA_CRC_FAIL;
    return(errorstatus);
  }
  else if (SDIO_GetFlagStatus(SDIO_FLAG_TXUNDERR) != RESET)
  {
    SDIO_ClearFlag(SDIO_FLAG_TXUNDERR);
    errorstatus = EMMC_TX_UNDERRUN;
    return(errorstatus);
  }
  else if (SDIO_GetFlagStatus(SDIO_FLAG_STBITERR) != RESET)
  {
    SDIO_ClearFlag(SDIO_FLAG_STBITERR);
    errorstatus = EMMC_START_BIT_ERR;
    return(errorstatus);
  }
#endif
//#if defined (SD_DMA_MODE)
//	
//  SDIO_ITConfig(SDIO_IT_DCRCFAIL | SDIO_IT_DTIMEOUT | SDIO_IT_DATAEND | SDIO_IT_RXOVERR | SDIO_IT_STBITERR, ENABLE);
//  EmmcLowLevelDMATxConfig((u32 *)writebuff, BlockSize);
//  SDIO_DMACmd(ENABLE);

//	errorstatus = EmmcWaitWriteOperation();
//	if(errorstatus !=  EMMC_OK)
//		{
//			return errorstatus;
//		}
//	
//	errorstatus = IsCardProgramming(&cardstate);

//  while ((errorstatus == EMMC_OK) && ((EMMC_CARD_PROGRAMMING == cardstate) || (EMMC_CARD_RECEIVING == cardstate)))
//  {

//    errorstatus = IsCardProgramming(&cardstate);
//	
//  }
//	
//#endif
  return(errorstatus);
}

/**
  * @brief  Allows to write blocks starting from a specified address in a card.
  *         The Data transfer can be managed by DMA mode only. 
  * @note   This operation should be followed by two functions to check if the 
  *         DMA Controller and SD Card status.
  *          - SD_ReadWaitOperation(): this function insure that the DMA
  *            controller has finished all data transfer.
  *          - SD_GetStatus(): to check that the SD Card has finished the 
  *            data transfer and it is ready for data.     
  * @param  WriteAddr: Address from where data are to be read.
  * @param  writebuff: pointer to the buffer that contain the data to be transferred.
  * @param  BlockSize: the SD card Data block size. The Block size should be 512.
  * @param  NumberOfBlocks: number of blocks to be written.
  * @retval EmmcError: SD Card Error code.
  */
//EmmcError EmmcWriteMultiBlocks(u8 *writebuff, u32 WriteAddr, u16 BlockSize, u32 NumberOfBlocks)
//{
//	SDIO_CmdInitTypeDef SDIO_CmdInitStructure;
//	SDIO_DataInitTypeDef SDIO_DataInitStructure;
//  EmmcError errorstatus = EMMC_OK;
//	u32 i = 0;
//	EmmcTransferState TranResult;
//	u8 cardstate = 0;
//  OS_CPU_SR cpu_sr=0;
//  TransferError = EMMC_OK;
//  TransferEnd = 0;
////  StopCondition = 1;
//  
//  SDIO->DCTRL = 0x0;

//	OS_ENTER_CRITICAL();
//	
//  /* Set Block Size for Card */ 
//  SDIO_CmdInitStructure.SDIO_Argument = (u32) BlockSize;
//  SDIO_CmdInitStructure.SDIO_CmdIndex = EMMC_CMD_SET_BLOCKLEN;
//  SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
//  SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
//  SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
//  SDIO_SendCommand(&SDIO_CmdInitStructure);

//  errorstatus = CmdResp1Error(EMMC_CMD_SET_BLOCKLEN);

//  if (EMMC_OK != errorstatus)
//  {
//    return(errorstatus);
//  }
//  

//  /*!< To improve performance */
//  SDIO_CmdInitStructure.SDIO_Argument = (u32) NumberOfBlocks;
//  SDIO_CmdInitStructure.SDIO_CmdIndex = EMMC_CMD_SET_BLOCK_COUNT;
//  SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
//  SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
//  SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
//  SDIO_SendCommand(&SDIO_CmdInitStructure);

//  errorstatus = CmdResp1Error(EMMC_CMD_SET_BLOCK_COUNT);

//  if (errorstatus != EMMC_OK)
//  {
//    return(errorstatus);
//  }


//  /*!< Send CMD25 WRITE_MULT_BLOCK with argument data address */
//  SDIO_CmdInitStructure.SDIO_Argument = (u32)WriteAddr;
//  SDIO_CmdInitStructure.SDIO_CmdIndex = EMMC_CMD_WRITE_MULT_BLOCK;
//  SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
//  SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
//  SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
//  SDIO_SendCommand(&SDIO_CmdInitStructure);

//  errorstatus = CmdResp1Error(EMMC_CMD_WRITE_MULT_BLOCK);

