isabei/mems_emmc/STM32F4 Template - EMMC/SYSTEM/sdio/sdio.c
//  if (EMMC_OK != errorstatus)
//  {
//    return(errorstatus);
//  }

//  SDIO_DataInitStructure.SDIO_DataTimeOut = EMMC_DATATIMEOUT;
//  SDIO_DataInitStructure.SDIO_DataLength = NumberOfBlocks * BlockSize;
//  SDIO_DataInitStructure.SDIO_DataBlockSize = (u32) 9 << 4;
//  SDIO_DataInitStructure.SDIO_TransferDir = SDIO_TransferDir_ToCard;
//  SDIO_DataInitStructure.SDIO_TransferMode = SDIO_TransferMode_Block;
//  SDIO_DataInitStructure.SDIO_DPSM = SDIO_DPSM_Disable;
//  SDIO_DataConfig(&SDIO_DataInitStructure);
//	
//  SDIO_DataInitStructure.SDIO_DataTimeOut = EMMC_DATATIMEOUT;
//  SDIO_DataInitStructure.SDIO_DataLength = NumberOfBlocks * BlockSize;
//  SDIO_DataInitStructure.SDIO_DataBlockSize = (u32) 9 << 4;
//  SDIO_DataInitStructure.SDIO_TransferDir = SDIO_TransferDir_ToCard;
//  SDIO_DataInitStructure.SDIO_TransferMode = SDIO_TransferMode_Block;
//  SDIO_DataInitStructure.SDIO_DPSM = SDIO_DPSM_Enable;
//  SDIO_DataConfig(&SDIO_DataInitStructure);
//  OS_EXIT_CRITICAL();
//	do
//	{			
//			OS_ENTER_CRITICAL();		
//			TranResult = EmmcGetStatus();
//			OS_EXIT_CRITICAL();
//	}while(TranResult != EMMC_TRANSFER_OK);
//	OS_ENTER_CRITICAL();
//  SDIO_ITConfig(SDIO_IT_DCRCFAIL | SDIO_IT_DTIMEOUT | SDIO_IT_DATAEND | SDIO_IT_RXOVERR | SDIO_IT_STBITERR, ENABLE);
//  SDIO_DMACmd(ENABLE);
//	EmmcLowLevelDMATxConfig((u32 *)writebuff, (NumberOfBlocks * BlockSize));
//  OS_EXIT_CRITICAL();
//	

//	errorstatus = EmmcWaitWriteOperation();

//	if (EMMC_OK != errorstatus)
//  {
//    return(errorstatus);
//  }
//		OS_ENTER_CRITICAL();
//	 errorstatus = IsCardProgramming(&cardstate);
//	  OS_EXIT_CRITICAL();
//	while ((errorstatus == EMMC_OK) && ((EMMC_CARD_PROGRAMMING == cardstate) || (EMMC_CARD_RECEIVING == cardstate)))
//  {
//		OS_ENTER_CRITICAL();
//    errorstatus = IsCardProgramming(&cardstate);
//		OS_EXIT_CRITICAL();
//		for(i=0; i<10000; i++);
//  }
//  return(errorstatus);
//}

/**
  * @brief  This function waits until the SDIO DMA data transfer is finished. 
  *         This function should be called after SDIO_WriteBlock() and
  *         SDIO_WriteMultiBlocks() function to insure that all data sent by the 
  *         card are already transferred by the DMA controller.        
  * @param  None.
  * @retval EmmcError: SD Card Error code.
  */
EmmcError EmmcWaitWriteOperation(void)
{
  EmmcError errorstatus = EMMC_OK;
  u32 timeout;

  timeout = EMMC_DATATIMEOUT;
  
  while ((DMAEndOfTransfer == 0x00) && (TransferEnd == 0) && (TransferError == EMMC_OK) && (timeout > 0))
  {
    timeout--;
  }
  
  DMAEndOfTransfer = 0x00;

  timeout = EMMC_DATATIMEOUT;
	
//	if (StopCondition == 1)
//	{
//		errorstatus = EmmcStopTransfer();
//		StopCondition = 0;
//	}
	
  while(((SDIO->STA & SDIO_FLAG_TXACT)) && (timeout > 0))
  {
    timeout--;  
  }
	/*!< Clear all the static flags */
		SDIO_ClearFlag(SDIO_STATIC_FLAGS);
  if ((timeout == 0) && (errorstatus == EMMC_OK))
  {
    errorstatus = EMMC_DATA_TIMEOUT;
  }
  if (TransferError != EMMC_OK)
  {
    return(TransferError);
  }
  else
  {
    return(errorstatus);
  }
}

/**
  * @brief  Gets the cuurent data transfer state.
  * @param  None
  * @retval SDTransferState: Data Transfer state.
  *   This value can be: 
  *        - SD_TRANSFER_OK: No data transfer is acting
  *        - SD_TRANSFER_BUSY: Data transfer is acting
  */
EmmcTransferState EmmcGetTransferState(void)
{
  if (SDIO->STA & (SDIO_FLAG_TXACT | SDIO_FLAG_RXACT))
  {
    return(EMMC_TRANSFER_BUSY);
  }
  else
  {
    return(EMMC_TRANSFER_OK);
  }
}

/**
  * @brief  Aborts an ongoing data transfer.
  * @param  None
  * @retval EmmcError: SD Card Error code.
  */
EmmcError EmmcStopTransfer(void)
{
	SDIO_CmdInitTypeDef SDIO_CmdInitStructure;
  EmmcError errorstatus = EMMC_OK;

  /*!< Send CMD12 STOP_TRANSMISSION  */
  SDIO_CmdInitStructure.SDIO_Argument = (u32)0;//(MyEmmcCardInfo.RCA << 16);
  SDIO_CmdInitStructure.SDIO_CmdIndex = EMMC_CMD_STOP_TRANSMISSION;
  SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
  SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
  SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
  SDIO_SendCommand(&SDIO_CmdInitStructure);

  errorstatus = CmdResp1Error(EMMC_CMD_STOP_TRANSMISSION);
  return(errorstatus);
}

/**
  * @brief  Allows to erase memory area specified for the given card.
  * @param  startaddr: the start address.
  * @param  endaddr: the end address.
  * @retval EmmcError: SD Card Error code.
  */
EmmcError EmmcErase(u32 startaddr, u32 endaddr)
{
	SDIO_CmdInitTypeDef SDIO_CmdInitStructure;
  EmmcError errorstatus = EMMC_OK;
  u32 delay = 0;
  __IO u32 maxdelay = 0;
  u8 cardstate = 0;
	
	/*!< Check if the card coomnd class supports erase command */
//  if (((CSD_Tab[1] >> 20) & SD_CCCC_ERASE) == 0)
		if ((MyEmmcCardInfo.EmmcCsd.CardComdClasses & EMMC_CCCC_ERASE) == 0)
		{
			errorstatus = EMMC_REQUEST_NOT_APPLICABLE;
			return(errorstatus);
		}

		maxdelay = 9200000 / ((SDIO->CLKCR & 0xFF) + 2);

		if (SDIO_GetResponse(SDIO_RESP1) & EMMC_CARD_LOCKED)
		{
			errorstatus = EMMC_LOCK_UNLOCK_FAILED;
			return(errorstatus);
		}

     /*!< Send CMD35 SD_ERASE_GRP_START with argument as addr  */
     SDIO_CmdInitStructure.SDIO_Argument = startaddr;
     SDIO_CmdInitStructure.SDIO_CmdIndex = EMMC_CMD_ERASE_GRP_START;
     SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
     SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
     SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
     SDIO_SendCommand(&SDIO_CmdInitStructure);

     errorstatus = CmdResp1Error(EMMC_CMD_ERASE_GRP_START);
     if (errorstatus != EMMC_OK)
     {
       return(errorstatus);
     }
//      for (delay = 0; delay < 10000; delay++);
     /*!< Send CMD36 SD_ERASE_GRP_END with argument as addr  */
     SDIO_CmdInitStructure.SDIO_Argument = endaddr;
     SDIO_CmdInitStructure.SDIO_CmdIndex = EMMC_CMD_ERASE_GRP_END;
     SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
     SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
     SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
     SDIO_SendCommand(&SDIO_CmdInitStructure);

     errorstatus = CmdResp1Error(EMMC_CMD_ERASE_GRP_END);
     if (errorstatus != EMMC_OK)
     {
       return(errorstatus);
     }
//		  for (delay = 0; delay < 10000; delay++);
   /*!< Send CMD38 ERASE */
//   SDIO_CmdInitStructure.SDIO_Argument = 0x03;
	 SDIO_CmdInitStructure.SDIO_Argument = 0x00;
   SDIO_CmdInitStructure.SDIO_CmdIndex = EMMC_CMD_ERASE;
   SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
   SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
   SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
   SDIO_SendCommand(&SDIO_CmdInitStructure);

