isabei/mems_emmc/STM32F4 Template - EMMC/SYSTEM/sdio/sdio.c
   errorstatus = CmdResp1Error(EMMC_CMD_ERASE);

   if (errorstatus != EMMC_OK)
   {
     return(errorstatus);
   }
  for (delay = 0; delay < maxdelay; delay++)
  {}

  /*!< Wait till the card is in programming state */
  errorstatus = IsCardProgramming(&cardstate);
  delay = EMMC_DATATIMEOUT;
  while ((delay > 0) && (errorstatus == EMMC_OK) && ((EMMC_CARD_PROGRAMMING == cardstate) || (EMMC_CARD_RECEIVING == cardstate)))
  {
    errorstatus = IsCardProgramming(&cardstate);
    delay--;
  }

  return(errorstatus);
}

/**
  * @brief  Returns the current card's status.
  * @param  pcardstatus: pointer to the buffer that will contain the SD card 
  *         status (Card Status register).
  * @retval EmmcError: SD Card Error code.
  */
EmmcError EmmcSendStatus(u32 *pcardstatus)
{
	SDIO_CmdInitTypeDef SDIO_CmdInitStructure;
  EmmcError errorstatus = EMMC_OK;

  if (pcardstatus == NULL)
  {
    errorstatus = EMMC_INVALID_PARAMETER;
    return(errorstatus);
  }

  SDIO_CmdInitStructure.SDIO_Argument = 0x00010000;
  SDIO_CmdInitStructure.SDIO_CmdIndex = EMMC_CMD_SEND_STATUS;
  SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
  SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
  SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
  SDIO_SendCommand(&SDIO_CmdInitStructure);

  errorstatus = CmdResp1Error(EMMC_CMD_SEND_STATUS);

  if (errorstatus != EMMC_OK)
  {
    return(errorstatus);
  }

  *pcardstatus = SDIO_GetResponse(SDIO_RESP1);

  return(errorstatus);
}

/**
  * @brief  Allows to process all the interrupts that are high.
  * @param  None
  * @retval EmmcError: SD Card Error code.
  */
//EmmcError EmmcProcessIRQSrc(void)
//{ 
//  if (SDIO_GetITStatus(SDIO_IT_DATAEND) != RESET)
//  {
//    TransferError = EMMC_OK;
//    SDIO_ClearITPendingBit(SDIO_IT_DATAEND);
//    TransferEnd = 1;
//  }  
//  else if (SDIO_GetITStatus(SDIO_IT_DCRCFAIL) != RESET)
//  {
//    SDIO_ClearITPendingBit(SDIO_IT_DCRCFAIL);
//    TransferError = EMMC_DATA_CRC_FAIL;
//  }
//  else if (SDIO_GetITStatus(SDIO_IT_DTIMEOUT) != RESET)
//  {
//    SDIO_ClearITPendingBit(SDIO_IT_DTIMEOUT);
//    TransferError = EMMC_DATA_TIMEOUT;
//  }
//  else if (SDIO_GetITStatus(SDIO_IT_RXOVERR) != RESET)
//  {
//    SDIO_ClearITPendingBit(SDIO_IT_RXOVERR);
//    TransferError = EMMC_RX_OVERRUN;
//  }
//  else if (SDIO_GetITStatus(SDIO_IT_TXUNDERR) != RESET)
//  {
//    SDIO_ClearITPendingBit(SDIO_IT_TXUNDERR);
//    TransferError = EMMC_TX_UNDERRUN;
//  }
//  else if (SDIO_GetITStatus(SDIO_IT_STBITERR) != RESET)
//  {
//    SDIO_ClearITPendingBit(SDIO_IT_STBITERR);
//    TransferError = EMMC_START_BIT_ERR;
//  }

//  SDIO_ITConfig(SDIO_IT_DCRCFAIL | SDIO_IT_DTIMEOUT | SDIO_IT_DATAEND |
//                SDIO_IT_TXFIFOHE | SDIO_IT_RXFIFOHF | SDIO_IT_TXUNDERR |
//                SDIO_IT_RXOVERR | SDIO_IT_STBITERR, DISABLE);
//  return(TransferError);
//}

/**
  * @brief  This function waits until the SDIO DMA data transfer is finished. 
  * @param  None.
  * @retval None.
  */
void EmmcProcessDMAIRQ(void)
{
  if(DMA2->LISR & EMMC_SDIO_DMA_FLAG_TCIF)
  {
    DMAEndOfTransfer = 0x01;
    DMA_ClearFlag(EMMC_SDIO_DMA_STREAM, EMMC_SDIO_DMA_FLAG_TCIF|EMMC_SDIO_DMA_FLAG_FEIF);
  }
}

/**
  * @brief  Checks for error conditions for CMD0.
  * @param  None
  * @retval EmmcError: SD Card Error code.
  */
EmmcError CmdError(void)
{
  EmmcError errorstatus = EMMC_OK;
  u32 timeout;

  timeout = SDIO_CMD0TIMEOUT; /*!< 10000 */

  while ((timeout > 0) && (SDIO_GetFlagStatus(SDIO_FLAG_CMDSENT) == RESET))
  {
    timeout--;
  }

  if (timeout == 0)
  {
    errorstatus = EMMC_CMD_RSP_TIMEOUT;
    return(errorstatus);
  }

  /*!< Clear all the static flags */
  SDIO_ClearFlag(SDIO_STATIC_FLAGS);

  return(errorstatus);
}

/**
  * @brief  Checks for error conditions for R7 response.
  * @param  None
  * @retval EmmcError: SD Card Error code.
  */
EmmcError CmdResp7Error(void)
{
  EmmcError errorstatus = EMMC_OK;
  u32 status;
  u32 timeout = SDIO_CMD0TIMEOUT;

  status = SDIO->STA;

  while (!(status & (SDIO_FLAG_CCRCFAIL | SDIO_FLAG_CMDREND | SDIO_FLAG_CTIMEOUT)) && (timeout > 0))
  {
    timeout--;
    status = SDIO->STA;
  }

  if ((timeout == 0) || (status & SDIO_FLAG_CTIMEOUT))
  {
    /*!< Card is not V2.0 complient or card does not support the set voltage range */
    errorstatus = EMMC_CMD_RSP_TIMEOUT;
    SDIO_ClearFlag(SDIO_FLAG_CTIMEOUT);
    return(errorstatus);
  }

  if (status & SDIO_FLAG_CMDREND)
  {
    /*!< Card is SD V2.0 compliant */
    errorstatus = EMMC_OK;
    SDIO_ClearFlag(SDIO_FLAG_CMDREND);
    return(errorstatus);
  }
  return(errorstatus);
}

/**
  * @brief  Checks for error conditions for R1 response.
  * @param  cmd: The sent command index.
  * @retval EmmcError: SD Card Error code.
  */
EmmcError CmdResp1Error(u8 cmd)
{
  EmmcError errorstatus = EMMC_OK;
  u32 status;
  u32 response_r1;

  status = SDIO->STA;

  while (!(status & (SDIO_FLAG_CCRCFAIL | SDIO_FLAG_CMDREND | SDIO_FLAG_CTIMEOUT)))
  {
    status = SDIO->STA;
  }

  if (status & SDIO_FLAG_CTIMEOUT)
  {
    errorstatus = EMMC_CMD_RSP_TIMEOUT;
    SDIO_ClearFlag(SDIO_FLAG_CTIMEOUT);
    return(errorstatus);
  }
  else if (status & SDIO_FLAG_CCRCFAIL)
  {
    errorstatus = EMMC_CMD_CRC_FAIL;
    SDIO_ClearFlag(SDIO_FLAG_CCRCFAIL);
    return(errorstatus);
  }

  /*!< Check response received is of desired command */
  if (SDIO_GetCommandResponse() != cmd)
  {
    errorstatus = EMMC_ILLEGAL_CMD;
    return(errorstatus);
  }

  /*!< Clear all the static flags */
  SDIO_ClearFlag(SDIO_STATIC_FLAGS);

  /*!< We have received response, retrieve it for analysis  */
  response_r1 = SDIO_GetResponse(SDIO_RESP1);

  if ((response_r1 & EMMC_OCR_ERRORBITS) == EMMC_ALLZERO)
  {
    return(errorstatus);
  }

  if (response_r1 & EMMC_OCR_ADDR_OUT_OF_RANGE)
  {
    return(EMMC_ADDR_OUT_OF_RANGE);
  }

  if (response_r1 & EMMC_OCR_ADDR_MISALIGNED)
  {
    return(EMMC_ADDR_MISALIGNED);
  }

  if (response_r1 & EMMC_OCR_BLOCK_LEN_ERR)
  {
    return(EMMC_BLOCK_LEN_ERR);
  }

  if (response_r1 & EMMC_OCR_ERASE_SEQ_ERR)
  {
    return(EMMC_ERASE_SEQ_ERR);
  }

  if (response_r1 & EMMC_OCR_BAD_ERASE_PARAM)
  {
    return(EMMC_BAD_ERASE_PARAM);
  }

  if (response_r1 & EMMC_OCR_WRITE_PROT_VIOLATION)
  {
    return(EMMC_WRITE_PROT_VIOLATION);
  }

  if (response_r1 & EMMC_OCR_LOCK_UNLOCK_FAILED)
  {
    return(EMMC_LOCK_UNLOCK_FAILED);
  }

  if (response_r1 & EMMC_OCR_COM_CRC_FAILED)
  {
    return(EMMC_COM_CRC_FAILED);
  }

  if (response_r1 & EMMC_OCR_ILLEGAL_CMD)
  {
    return(EMMC_ILLEGAL_CMD);
  }

  if (response_r1 & EMMC_OCR_CARD_ECC_FAILED)
  {
    return(EMMC_CARD_ECC_FAILED);
  }

  if (response_r1 & EMMC_OCR_CC_ERROR)
  {
    return(EMMC_CC_ERROR);
  }

  if (response_r1 & EMMC_OCR_GENERAL_UNKNOWN_ERROR)
  {
    return(EMMC_GENERAL_UNKNOWN_ERROR);
  }

  if (response_r1 & EMMC_OCR_STREAM_READ_UNDERRUN)
  {
    return(EMMC_STREAM_READ_UNDERRUN);
  }

  if (response_r1 & EMMC_OCR_STREAM_WRITE_OVERRUN)
  {
    return(EMMC_STREAM_WRITE_OVERRUN);
  }

