isabei/mems_emmc/STM32F4 Template - EMMC/SYSTEM/sdio/sdio.c
//   if (response_r1 & EMMC_OCR_CID_CSD_OVERWRIETE)
//   {
//   //  return(EMMC_CID_CSD_OVERWRITE);
//   }

//   if (response_r1 & EMMC_OCR_WP_ERASE_SKIP)
//   {
//     return(EMMC_WP_ERASE_SKIP);
//   }

  if (response_r1 & EMMC_OCR_CARD_ECC_DISABLED)
  {
    return(EMMC_CARD_ECC_DISABLED);
  }

  if (response_r1 & EMMC_OCR_ERASE_RESET)
  {
    return(EMMC_ERASE_RESET);
  }

  if (response_r1 & EMMC_OCR_AKE_SEQ_ERROR)
  {
    return(EMMC_AKE_SEQ_ERROR);
  }
  return(errorstatus);
}

/**
  * @brief  Checks for error conditions for R3 (OCR) response.
  * @param  None
  * @retval EmmcError: SD Card Error code.
  */
EmmcError CmdResp3Error(void)
{
  EmmcError errorstatus = EMMC_OK;
  u32 status;

  status = SDIO->STA;
	

  while (!(status & (SDIO_FLAG_CCRCFAIL | SDIO_FLAG_CMDREND | SDIO_FLAG_CTIMEOUT)))
  {
    status = SDIO->STA;
		
  }
  
  if (status & SDIO_FLAG_CTIMEOUT)
  {
    errorstatus = EMMC_CMD_RSP_TIMEOUT;
    SDIO_ClearFlag(SDIO_FLAG_CTIMEOUT);
    return(errorstatus);
  }
  /*!< Clear all the static flags */
  SDIO_ClearFlag(SDIO_STATIC_FLAGS);
  return(errorstatus);
}

/**
  * @brief  Checks for error conditions for R2 (CID or CSD) response.
  * @param  None
  * @retval EmmcError: SD Card Error code.
  */
EmmcError CmdResp2Error(void)
{
  EmmcError errorstatus = EMMC_OK;
  u32 status;

  status = SDIO->STA;

  while (!(status & (SDIO_FLAG_CCRCFAIL | SDIO_FLAG_CTIMEOUT | SDIO_FLAG_CMDREND)))
  {
    status = SDIO->STA;
  }

  if (status & SDIO_FLAG_CTIMEOUT)
  {
    errorstatus = EMMC_CMD_RSP_TIMEOUT;
    SDIO_ClearFlag(SDIO_FLAG_CTIMEOUT);
    return(errorstatus);
  }
  else if (status & SDIO_FLAG_CCRCFAIL)
  {
    errorstatus = EMMC_CMD_CRC_FAIL;
    SDIO_ClearFlag(SDIO_FLAG_CCRCFAIL);
    return(errorstatus);
  }

  /*!< Clear all the static flags */
  SDIO_ClearFlag(SDIO_STATIC_FLAGS);

  return(errorstatus);
}

/**
  * @brief  Checks for error conditions for R6 (RCA) response.
  * @param  cmd: The sent command index.
  * @param  prca: pointer to the variable that will contain the SD card relative 
  *         address RCA. 
  * @retval EmmcError: SD Card Error code.
  */
EmmcError CmdResp6Error(u8 cmd, u16 *prca)
{
  EmmcError errorstatus = EMMC_OK;
  u32 status;
  u32 response_r1;

  status = SDIO->STA;

  while (!(status & (SDIO_FLAG_CCRCFAIL | SDIO_FLAG_CTIMEOUT | SDIO_FLAG_CMDREND)))
  {
    status = SDIO->STA;
  }

  if (status & SDIO_FLAG_CTIMEOUT)
  {
    errorstatus = EMMC_CMD_RSP_TIMEOUT;
    SDIO_ClearFlag(SDIO_FLAG_CTIMEOUT);
    return(errorstatus);
  }
  else if (status & SDIO_FLAG_CCRCFAIL)
  {
    errorstatus = EMMC_CMD_CRC_FAIL;
    SDIO_ClearFlag(SDIO_FLAG_CCRCFAIL);
    return(errorstatus);
  }

  /*!< Check response received is of desired command */
  if (SDIO_GetCommandResponse() != cmd)
  {
    errorstatus = EMMC_ILLEGAL_CMD;
    return(errorstatus);
  }

  /*!< Clear all the static flags */
  SDIO_ClearFlag(SDIO_STATIC_FLAGS);

  /*!< We have received response, retrieve it.  */
  response_r1 = SDIO_GetResponse(SDIO_RESP1);

  if (EMMC_ALLZERO == (response_r1 & (EMMC_R6_GENERAL_UNKNOWN_ERROR | EMMC_R6_ILLEGAL_CMD | EMMC_R6_COM_CRC_FAILED)))
  {
    *prca = (u16) (response_r1 >> 16);
    return(errorstatus);
  }

  if (response_r1 & EMMC_R6_GENERAL_UNKNOWN_ERROR)
  {
    return(EMMC_GENERAL_UNKNOWN_ERROR);
  }

  if (response_r1 & EMMC_R6_ILLEGAL_CMD)
  {
    return(EMMC_ILLEGAL_CMD);
  }

  if (response_r1 & EMMC_R6_COM_CRC_FAILED)
  {
    return(EMMC_COM_CRC_FAILED);
  }

  return(errorstatus);
}

/**
  * @brief  Enables or disables the SDIO wide bus mode.
  * @param  NewState: new state of the SDIO wide bus mode.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval EmmcError: SD Card Error code.
  */
EmmcError EmmcEnWideBus(FunctionalState NewState)
{
	SDIO_CmdInitTypeDef SDIO_CmdInitStructure;
  EmmcError Result = EMMC_ERROR;

//  u32 scr[2] = {0, 0};

  if (SDIO_GetResponse(SDIO_RESP1) & EMMC_CARD_LOCKED)
  {
    Result = EMMC_LOCK_UNLOCK_FAILED;
    return(Result);
  }

  /*!< If wide bus operation to be enabled */
  if (NewState == ENABLE)
  {

				/* CMD6 更改power class*/ 
			SDIO_CmdInitStructure.SDIO_Argument = EMMC_POWER_REG;
			SDIO_CmdInitStructure.SDIO_CmdIndex = EMMC_CMD_HS_SWITCH;
			SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
			SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
			SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
			SDIO_SendCommand(&SDIO_CmdInitStructure);
      
			Result = CmdResp1Error(EMMC_CMD_HS_SWITCH);
		
		  if (EMMC_OK != Result)
			{
//				LED3=1;
//				LED4=1;
//				LED5=0;
//				delay_ms(100);
				return(Result);
			}
			
							/* CMD6 改成高速模式*/ 
			delay_ms(10);
			SDIO_CmdInitStructure.SDIO_Argument = EMMC_HIGHSPEED_REG;
			SDIO_CmdInitStructure.SDIO_CmdIndex = EMMC_CMD_HS_SWITCH;
			SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
			SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
			SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
			SDIO_SendCommand(&SDIO_CmdInitStructure);
			
			Result = CmdResp1Error(EMMC_CMD_HS_SWITCH);
			delay_us(100);
		  if (EMMC_OK != Result)
			{
//				LED3=0;
//				LED4=0;
//				LED5=1;
//				delay_ms(100);
				return(Result);
			}
			
			/* CMD6 改成8bit数据宽度*/ 
			delay_ms(10);
			SDIO_CmdInitStructure.SDIO_Argument = EMMC_8BIT_REG;
			SDIO_CmdInitStructure.SDIO_CmdIndex = EMMC_CMD_HS_SWITCH;
			SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
			SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
			SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
			SDIO_SendCommand(&SDIO_CmdInitStructure);

			Result = CmdResp1Error(EMMC_CMD_HS_SWITCH);
			if (EMMC_OK != Result)
			{
//				LED3=0;
//				LED4=1;
//				LED5=0;
//				delay_ms(100);
				return(Result);
			}
      return(Result);
  }   /*!< If wide bus operation to be disabled */
  else
  {
      Result = CmdResp1Error(EMMC_CMD_APP_CMD);

      if (Result != EMMC_OK)
      {
        return(Result);
      }

      if (Result != EMMC_OK)
      {
        return(Result);
      }

      return(Result);
  }
}

/**
  * @brief  Checks if the SD card is in programming state.
  * @param  pstatus: pointer to the variable that will contain the SD card state.
  * @retval EmmcError: SD Card Error code.
  */
EmmcError IsCardProgramming(u8 *pstatus)
{
	SDIO_CmdInitTypeDef SDIO_CmdInitStructure;
  EmmcError errorstatus = EMMC_OK;
  __IO u32 respR1 = 0, status = 0;

