isabei/mems_emmc/STM32F4 Template - EMMC/SYSTEM/sdio/sdio.c
  SDIO_CmdInitStructure.SDIO_Argument = (u32) MyEmmcCardInfo.RCA << 16;
  SDIO_CmdInitStructure.SDIO_CmdIndex = EMMC_CMD_SEND_STATUS;
  SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
  SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
  SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
  SDIO_SendCommand(&SDIO_CmdInitStructure);

  status = SDIO->STA;
  while (!(status & (SDIO_FLAG_CCRCFAIL | SDIO_FLAG_CMDREND | SDIO_FLAG_CTIMEOUT)))
  {
    status = SDIO->STA;
  }

  if (status & SDIO_FLAG_CTIMEOUT)
  {
    errorstatus = EMMC_CMD_RSP_TIMEOUT;
    SDIO_ClearFlag(SDIO_FLAG_CTIMEOUT);
    return(errorstatus);
  }
  else if (status & SDIO_FLAG_CCRCFAIL)
  {
    errorstatus = EMMC_CMD_CRC_FAIL;
    SDIO_ClearFlag(SDIO_FLAG_CCRCFAIL);
    return(errorstatus);
  }

  status = (u32)SDIO_GetCommandResponse();

  /*!< Check response received is of desired command */
  if (status != EMMC_CMD_SEND_STATUS)
  {
    errorstatus = EMMC_ILLEGAL_CMD;
    return(errorstatus);
  }

  /*!< Clear all the static flags */
  SDIO_ClearFlag(SDIO_STATIC_FLAGS);


  /*!< We have received response, retrieve it for analysis  */
  respR1 = SDIO_GetResponse(SDIO_RESP1);

  /*!< Find out card status */
  *pstatus = (u8) ((respR1 >> 9) & 0x0000000F);

  if ((respR1 & EMMC_OCR_ERRORBITS) == EMMC_ALLZERO)
  {
    return(errorstatus);
  }

  if (respR1 & EMMC_OCR_ADDR_OUT_OF_RANGE)
  {
    return(EMMC_ADDR_OUT_OF_RANGE);
  }

  if (respR1 & EMMC_OCR_ADDR_MISALIGNED)
  {
    return(EMMC_ADDR_MISALIGNED);
  }

  if (respR1 & EMMC_OCR_BLOCK_LEN_ERR)
  {
    return(EMMC_BLOCK_LEN_ERR);
  }

  if (respR1 & EMMC_OCR_ERASE_SEQ_ERR)
  {
    return(EMMC_ERASE_SEQ_ERR);
  }

  if (respR1 & EMMC_OCR_BAD_ERASE_PARAM)
  {
    return(EMMC_BAD_ERASE_PARAM);
  }

  if (respR1 & EMMC_OCR_WRITE_PROT_VIOLATION)
  {
    return(EMMC_WRITE_PROT_VIOLATION);
  }

  if (respR1 & EMMC_OCR_LOCK_UNLOCK_FAILED)
  {
    return(EMMC_LOCK_UNLOCK_FAILED);
  }

  if (respR1 & EMMC_OCR_COM_CRC_FAILED)
  {
    return(EMMC_COM_CRC_FAILED);
  }

  if (respR1 & EMMC_OCR_ILLEGAL_CMD)
  {
    return(EMMC_ILLEGAL_CMD);
  }

  if (respR1 & EMMC_OCR_CARD_ECC_FAILED)
  {
    return(EMMC_CARD_ECC_FAILED);
  }

  if (respR1 & EMMC_OCR_CC_ERROR)
  {
    return(EMMC_CC_ERROR);
  }

  if (respR1 & EMMC_OCR_GENERAL_UNKNOWN_ERROR)
  {
    return(EMMC_GENERAL_UNKNOWN_ERROR);
  }

  if (respR1 & EMMC_OCR_STREAM_READ_UNDERRUN)
  {
    return(EMMC_STREAM_READ_UNDERRUN);
  }

  if (respR1 & EMMC_OCR_STREAM_WRITE_OVERRUN)
  {
    return(EMMC_STREAM_WRITE_OVERRUN);
  }

//   if (respR1 & EMMC_OCR_CID_CSD_OVERWRIETE)
//   {
//     return(EMMC_CID_CSD_OVERWRITE);
//   }

//   if (respR1 & EMMC_OCR_WP_ERASE_SKIP)
//   {
//     return(EMMC_WP_ERASE_SKIP);
//   }

  if (respR1 & EMMC_OCR_CARD_ECC_DISABLED)
  {
    return(EMMC_CARD_ECC_DISABLED);
  }

  if (respR1 & EMMC_OCR_ERASE_RESET)
  {
    return(EMMC_ERASE_RESET);
  }

  if (respR1 & EMMC_OCR_AKE_SEQ_ERROR)
  {
    return(EMMC_AKE_SEQ_ERROR);
  }

  return(errorstatus);
}


/**
  * @brief  Converts the number of bytes in power of two and returns the power.
  * @param  NumberOfBytes: number of bytes.
  * @retval None
  */
u8 convert_from_bytes_to_power_of_two(u16 NumberOfBytes)
{
  u8 count = 0;

  while (NumberOfBytes != 1)
  {
    NumberOfBytes >>= 1;
    count++;
  }
  return(count);
}































